# Importing Stock Listing Data from Excel

## Work By - **RAVJOT SINGH**

E-Mail - ravjot313@gmail.com

Website - https://ravjot03.github.io/

LinkedIn - https://www.linkedin.com/in/ravjot03/

GitHub - https://github.com/Ravjot03

Medium - https://medium.com/@ravjot03

## Importing pandas library

In [1]:
import pandas as pd

##Reading, Inspecting and Cleansing Data from CSV

###Import and Inspect Data

In [2]:
amex = pd.read_csv('amex-listings.csv')
amex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           360 non-null    object
 1   Company Name           360 non-null    object
 2   Last Sale              346 non-null    float64
 3   Market Capitalization  360 non-null    float64
 4   IPO Year               105 non-null    float64
 5   Sector                 238 non-null    object
 6   Industry               238 non-null    object
 7   Last Update            360 non-null    object
dtypes: float64(3), object(5)
memory usage: 22.6+ KB

In [3]:
amex.head(3)

  Stock Symbol  ... Last Update
0         XXII  ...     4/26/17
1          FAX  ...     4/25/17
2          IAF  ...     4/23/17

[3 rows x 8 columns]

###Dealing with Missing values

Replaces `n/a` with `np.nan`

`na_values`: Converts a given string to `np.nan`, defaults to `None`.

In [4]:
amex = pd.read_csv('amex-listings.csv', na_values='n/a')
amex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           360 non-null    object
 1   Company Name           360 non-null    object
 2   Last Sale              346 non-null    float64
 3   Market Capitalization  360 non-null    float64
 4   IPO Year               105 non-null    float64
 5   Sector                 238 non-null    object
 6   Industry               238 non-null    object
 7   Last Update            360 non-null    object
dtypes: float64(3), object(5)
memory usage: 22.6+ KB

In [5]:
amex.head(3)

  Stock Symbol  ... Last Update
0         XXII  ...     4/26/17
1          FAX  ...     4/25/17
2          IAF  ...     4/23/17

[3 rows x 8 columns]

###Properly Parsing Dates

`parse_dates`: Reads the data in a list of given columns as `dtype` `datetime64`, defaults to `False`.

In [6]:
amex = pd.read_csv('amex-listings.csv', na_values='n/a', parse_dates=['Last Update'])
amex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           360 non-null    object
 1   Company Name           360 non-null    object
 2   Last Sale              346 non-null    float64
 3   Market Capitalization  360 non-null    float64
 4   IPO Year               105 non-null    float64
 5   Sector                 238 non-null    object
 6   Industry               238 non-null    object
 7   Last Update            360 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 22.6+ KB

In [7]:
amex.head(3)

  Stock Symbol  ... Last Update
0         XXII  ...  2017-04-26
1          FAX  ...  2017-04-25
2          IAF  ...  2017-04-23

[3 rows x 8 columns]

##Read Data from Excel Sheets

###Import Data from Excel

`pd.read_excel(file, sheet_name)`

*   Select first sheet by default with `sheet_name = 0`
*   Select by name with `sheet_name = 'amex'`
*   Import several sheets with list such as `sheet_name = ['amex','nasdaq']`

In [8]:
amex = pd.read_excel('listings.xlsx', sheet_name='amex', na_values='n/a')
amex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           360 non-null    object
 1   Company Name           360 non-null    object
 2   Last Sale              346 non-null    float64
 3   Market Capitalization  360 non-null    float64
 4   IPO Year               105 non-null    float64
 5   Sector                 238 non-null    object
 6   Industry               238 non-null    object
dtypes: float64(3), object(4)
memory usage: 19.8+ KB

In [9]:
listings = pd.read_excel('listings.xlsx', na_values='n/a', sheet_name=['amex', 'nasdaq'])
print(listings['amex'].info())
print("")
print(listings['nasdaq'].info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           360 non-null    object
 1   Company Name           360 non-null    object
 2   Last Sale              346 non-null    float64
 3   Market Capitalization  360 non-null    float64
 4   IPO Year               105 non-null    float64
 5   Sector                 238 non-null    object
 6   Industry               238 non-null    object
dtypes: float64(3), object(4)
memory usage: 19.8+ KB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3167 entries, 0 to 3166
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           3167 non-null   object
 1   Company Name           3167 non-null   object
 2   Last Sale              3165 non-null   float64
 3   Market Capitalization  3167 non-null   float64
 4   IPO Year               1386 non-null   float64
 5   Sector                 2767 non-null   object
 6   Industry               2767 non-null   object
dtypes: float64(3), object(4)
memory usage: 173.3+ KB
None

###Get Sheet Names

In [10]:
xls = pd.ExcelFile('listings.xlsx')  #pd.ExcelFile object
exchanges = xls.sheet_names
exchanges

['amex', 'nasdaq', 'nyse']

In [11]:
nyse = pd.read_excel(xls, sheet_name=exchanges[2], na_values='n/a')
nyse.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3147 entries, 0 to 3146
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           3147 non-null   object
 1   Company Name           3147 non-null   object
 2   Last Sale              3079 non-null   float64
 3   Market Capitalization  3147 non-null   float64
 4   IPO Year               1361 non-null   float64
 5   Sector                 2177 non-null   object
 6   Industry               2177 non-null   object
dtypes: float64(3), object(4)
memory usage: 172.2+ KB

##Combining Data from different worksheets

###Concatenate two dataframes

In [12]:
amex = pd.read_excel('listings.xlsx', sheet_name='amex', na_values='n/a')
nasdaq = pd.read_excel('listings.xlsx', sheet_name='nasdaq', na_values='n/a')
nyse = pd.read_excel('listings.xlsx', sheet_name='nyse', na_values='n/a')

In [13]:
pd.concat([amex, nyse]).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3507 entries, 0 to 3146
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           3507 non-null   object
 1   Company Name           3507 non-null   object
 2   Last Sale              3425 non-null   float64
 3   Market Capitalization  3507 non-null   float64
 4   IPO Year               1466 non-null   float64
 5   Sector                 2415 non-null   object
 6   Industry               2415 non-null   object
dtypes: float64(3), object(4)
memory usage: 219.2+ KB

In [14]:
pd.concat([amex, nyse]).head(2)

  Stock Symbol  ...               Industry
0         XXII  ...  Farming/Seeds/Milling
1          FAX  ...                    NaN

[2 rows x 7 columns]

In [15]:
#Add column to reference source
amex['Exchange'] = 'AMEX'
nyse['Exchange'] = 'NYSE'

pd.concat([amex, nyse]).head(2)

  Stock Symbol  ... Exchange
0         XXII  ...     AMEX
1          FAX  ...     AMEX

[2 rows x 8 columns]

###Combine three DataFrames

In [16]:
xls = pd.ExcelFile('listings.xlsx')

exchanges = xls.sheet_names

listings = [] #Create empty list to collect DataFrames

for exchange in exchanges:
  listing = pd.read_excel(xls, sheet_name=exchange)

  listing['Exchange'] = exchange  #Add reference column

  listings.append(listing)  #Add DataFrame to list

combined_listings = pd.concat(listings)  #List of DataFrames

In [17]:
combined_listings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6674 entries, 0 to 3146
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Stock Symbol           6674 non-null   object
 1   Company Name           6674 non-null   object
 2   Last Sale              6590 non-null   float64
 3   Market Capitalization  6674 non-null   float64
 4   IPO Year               2852 non-null   float64
 5   Sector                 5182 non-null   object
 6   Industry               5182 non-null   object
 7   Exchange               6674 non-null   object
dtypes: float64(3), object(5)
memory usage: 469.3+ KB

## Conclusion

In this jupyter notebook, I have explained how to import, clean and combine data from Excel Workbook sheets into a pandas DataFrame.